app/controllers/posts_controller.rb

  def close
    @post = Post.find(params[:id])
    @post.test = true
    @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "posts" SET "test" = 't', "updated_at" = '2013-03-25 09:50:41.916154' WHERE "posts"."id" = 5

  def open
    @post = Post.find(params[:id])
    @post.test = false
    @post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "test" = 'f', "updated_at" = '2013-03-25 14:01:58.273371' WHERE "posts"."id" = 2

  def delete_comments
    @post = Post.find(params[:id])
    @post.comments.destroy_all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("closed", "content", "created_at", "email", "name", "test", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'Probleemid loomaaias', "content" = 'Ma pean siia rohkem kirjutama!', "updated_at" = '2013-03-27 14:18:57.853819' WHERE "posts"."id" = 8